# Series

In [2]:
'''pandas = panel data'''
#Getting Started
import pandas as pd
data_set= {

    "cars":["beat","swift","fortuner","gtr"],
    "name":["sneh","krish","jeel","utsav"]
}
seres = pd.DataFrame(data_set)
print(seres)

       cars   name
0      beat   sneh
1     swift  krish
2  fortuner   jeel
3       gtr  utsav

In [24]:
#series
a = [1,2,3,4]
b = pd.Series(a)
print(b[0])
print(b)

#Creating labesls
b = pd.Series(a,index=['x','y','z','a'])
print(b)
#When you have created labels, you can access an item by referring to the label.
print(b['a'])

#Key/Value Objects as Series
#You can also use a key/value object, like a dictionary, when creating a Series.
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)
#To select only some of the items in the dictionary, use the index argument and specify only the items you want to include in the Series.
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories,index=["day1","day2"])
print(myvar)

1
0    1
1    2
2    3
3    4
dtype: int64
x    1
y    2
z    3
a    4
dtype: int64
4
day1    420
day2    380
day3    390
dtype: int64
day1    420
day2    380
dtype: int64

# DataFrame

In [25]:
#DataFrames
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
#load data into a DataFrame object:
df = pd.DataFrame(data)
print(df) 
#refer to the row index:
print(df.loc[0])
#use a list of indexes:
print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40
2       390        45
calories    420
duration     50
Name: 0, dtype: int64
   calories  duration
0       420        50
1       380        40

# Filtering

In [3]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [4]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [22]:
movies[movies['duration'] < 120].head()

,star_rating,title,content_rating,genre,duration,actors_list
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
23,8.7,The Usual Suspects,R,Crime,106,"[u'Kevin Spacey', u'Gabriel Byrne', u'Chazz Pa..."
25,8.6,Life Is Beautiful,PG-13,Comedy,116,"[u'Roberto Benigni', u'Nicoletta Braschi', u'G..."
27,8.6,The Silence of the Lambs,R,Drama,118,"[u'Jodie Foster', u'Anthony Hopkins', u'Lawren..."
28,8.6,Leon: The Professional,R,Crime,110,"[u'Jean Reno', u'Gary Oldman', u'Natalie Portm..."

In [23]:
# This is also true
movies[movies.genre=='Crime'].head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
21,8.7,City of God,R,Crime,130,"[u'Alexandre Rodrigues', u'Matheus Nachtergael..."

In [13]:
howmany = movies[movies.genre=='Action']
howmany.shape

(136, 6)

In [15]:
howmany.head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
19,8.7,Star Wars,PG,Action,121,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
20,8.7,The Matrix,R,Action,136,"[u'Keanu Reeves', u'Laurence Fishburne', u'Car..."

In [24]:
movies[(movies['duration']>=150) & (movies['genre']=='Action')].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
36,8.6,Saving Private Ryan,R,Action,169,"[u'Tom Hanks', u'Matt Damon', u'Tom Sizemore']"
43,8.5,The Dark Knight Rises,PG-13,Action,165,"[u'Christian Bale', u'Tom Hardy', u'Anne Hatha..."
44,8.5,Gladiator,R,Action,155,"[u'Russell Crowe', u'Joaquin Phoenix', u'Conni..."
82,8.4,Braveheart,R,Action,177,"[u'Mel Gibson', u'Sophie Marceau', u'Patrick M..."

In [25]:
movies[(movies.genre == 'Drama') | (movies.duration >= 200 ) ].head()

,star_rating,title,content_rating,genre,duration,actors_list
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
13,8.8,Forrest Gump,PG-13,Drama,142,"[u'Tom Hanks', u'Robin Wright', u'Gary Sinise']"

In [26]:
movies[(movies.genre == 'Drama') | (movies.genre == 'Action') | (movies.genre == 'Crime')].head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [27]:
this_gives_boolean = movies.genre.isin(['Action','Drama'])
this_gives_boolean.head()

0    False
1    False
2    False
3     True
4    False
Name: genre, dtype: bool

In [29]:
movies[this_gives_boolean].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."

In [30]:
movies.loc[47]
#You’re asking pandas: “Give me the row with index label 47 from the movies DataFrame.”

star_rating                                                     8.5
title                                              Taare Zameen Par
content_rating                                                   PG
genre                                                         Drama
duration                                                        165
actors_list       [u'Darsheel Safary', u'Aamir Khan', u'Tanay Ch...
Name: 47, dtype: object

# sorting

In [14]:
movies.star_rating.sort_values(ascending=False).head()  # type = series

0    9.3
1    9.2
2    9.1
3    9.0
4    8.9
Name: star_rating, dtype: float64

In [19]:
movies.sort_values(['genre','star_rating'],ascending=[True,False]).head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
19,8.7,Star Wars,PG,Action,121,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
20,8.7,The Matrix,R,Action,136,"[u'Keanu Reeves', u'Laurence Fishburne', u'Car..."

# Removing

In [3]:
ufo = pd.read_table('http://bit.ly/uforeports',sep = ',')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
# This is how you can add one more columns by using data of another columns
ufo['Location'] = ufo['City'] +  ',' + ufo['State']

In [5]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

#### Removing colum

In [ ]:
#Now i dont want city and state colums
ufo.drop(['City','State'],axis=1,inplace=True)

In [12]:
ufo.head()

   Colors Reported Shape Reported              Time     Location
7              NaN           DISK    7/15/1936 0:00      Alma,MI
8              NaN          CIGAR  10/15/1936 17:00   Eklutna,AK
9              NaN       CYLINDER    6/15/1937 0:00   Hubbard,OR
10             NaN          LIGHT   8/15/1937 21:00   Fontana,CA
11             NaN       FIREBALL    6/1/1939 20:00  Waterloo,AL

#### Removing index(row)

In [8]:
ufo.drop([0,1],axis = 0,inplace = True)

In [9]:
ufo.drop(ufo.index[0:5], inplace=True)

In [10]:
ufo.head()

   Colors Reported Shape Reported              Time     Location
7              NaN           DISK    7/15/1936 0:00      Alma,MI
8              NaN          CIGAR  10/15/1936 17:00   Eklutna,AK
9              NaN       CYLINDER    6/15/1937 0:00   Hubbard,OR
10             NaN          LIGHT   8/15/1937 21:00   Fontana,CA
11             NaN       FIREBALL    6/1/1939 20:00  Waterloo,AL

In [13]:
chufo = ufo.drop(ufo[ufo['Shape Reported']=='DISK'].index,inplace=False)
chufo.head()

   Colors Reported Shape Reported              Time     Location
8              NaN          CIGAR  10/15/1936 17:00   Eklutna,AK
9              NaN       CYLINDER    6/15/1937 0:00   Hubbard,OR
10             NaN          LIGHT   8/15/1937 21:00   Fontana,CA
11             NaN       FIREBALL    6/1/1939 20:00  Waterloo,AL
12             RED         SPHERE   6/30/1939 20:00    Belton,SC

# Things you should kmow

In [3]:
ufo.describe()

           City Colors Reported Shape Reported  State              Time
count     18215            2882          15597  18241             18241
unique     6475              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
ufo.shape

(18241, 5)

In [7]:
ufo.sample(5)  # gives any 5 random

              City Colors Reported Shape Reported State             Time
14312   Santa Cruz             NaN         SPHERE    CA  8/25/1999 21:30
15645    El Centro             NaN          OTHER    CA    1/3/2000 7:30
10152    Charlotte             NaN            NaN    NC  4/15/1997 22:00
10732     Billings             NaN          CIGAR    MT  8/23/1997 20:00
16814  Lincon City             NaN          CROSS    OR    7/6/2000 0:30

In [10]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [12]:
ufo.index

RangeIndex(start=0, stop=18241, step=1)

In [13]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18215 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [14]:
type(ufo)

pandas.core.frame.DataFrame

In [53]:
ufo.tail()

              City Colors_Reported Shape_Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

In [56]:
ufo.City.unique()

array(['Ithaca', 'Willingboro', 'Holyoke', ..., 'Capitola', 'Grant Park',
       'Ybor'], shape=(6476,), dtype=object)

In [58]:
ufo.City.value_counts()

City
Seattle          187
New York City    161
Phoenix          137
Houston          108
Las Vegas        105
                ...
Lake Sonoma        1
Von Ormy           1
Grosse Pointe      1
Grosse Point       1
Ybor               1
Name: count, Length: 6475, dtype: int64

# Renaming things

In [15]:
renamed_ufo=ufo.rename(columns={'City':'Town',"State":"Rajya"},inplace=False)
renamed_ufo.head()

                   Town Colors Reported Shape Reported Rajya             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [16]:
renaming_again = ['Town','Colors Rported','SHape Reported',"States"]
ufo.colums= renamed_ufo
ufo.head()

C:\Users\shivk\AppData\Local\Temp\ipykernel_43516\147506197.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  ufo.colums= renamed_ufo

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [17]:
ufo.columns = ufo.columns.str.replace(' ' ,'_')

In [ ]:
ufo.columns.str.lower()         # all lowercase

In [ ]:
ufo.columns.str.title()         # Title Case

In [ ]:
ufo.columns.str.upper()         # all uppercase

In [ ]:
ufo.columns.str.strip()         # remove leading/trailing spac

In [52]:
indexx =0
for index,series in ufo.iterrows():
    print(index,series.City,series.Time)
    indexx+=1
    if index==10:
        break

0 Ithaca 6/1/1930 22:00
1 Willingboro 6/30/1930 20:00
2 Holyoke 2/15/1931 14:00
3 Abilene 6/1/1931 13:00
4 New York Worlds Fair 4/18/1933 19:00
5 Valley City 9/15/1934 15:30
6 Crater Lake 6/15/1935 0:00
7 Alma 7/15/1936 0:00
8 Eklutna 10/15/1936 17:00
9 Hubbard 6/15/1937 0:00
10 Fontana 8/15/1937 21:00

In [46]:
type(bho)

pandas.core.series.Series

In [48]:
ufo.loc[3]

City                      Abilene
Colors_Reported               NaN
Shape_Reported               DISK
State                          KS
Time               6/1/1931 13:00
Name: 3, dtype: object

In [50]:
ufo.iloc[13]

City                      Keokuk
Colors_Reported              NaN
Shape_Reported              OVAL
State                         IA
Time               7/7/1939 2:00
Name: 13, dtype: object

In [51]:
# Difference between .loc and .iloc (simple explanation)

# .loc → label-based (use names)
# .iloc → index-based (use numbers)

# 🔹 Example 1: .loc (uses row/column names)
print("Using .loc:")
print(ufo.loc[0:2, ['City', 'State']])   # rows with index labels 0,1,2 → columns City & State
# 👉 .loc includes the last label (2)

# 🔹 Example 2: .iloc (uses row/column positions)
print("\nUsing .iloc:")
print(ufo.iloc[0:2, [0, 1]])             # rows 0 & 1 → first two columns
# 👉 .iloc excludes the last index (2)

Using .loc:
          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

Using .iloc:
          City Colors_Reported
0       Ithaca             NaN
1  Willingboro             NaN

In [4]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18215 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [2]:
import pandas as pd
import numpy as np

data = {
    'City': ['New York', 'los angeles ', 'Chicago', np.nan, 'Houston', 'Phoenix', '   Dallas'],
    'State': ['NY', 'CA', 'IL', 'TX', np.nan, 'AZ', 'TX'],
    'Shape Reported': ['DISK', 'light', np.nan, 'CIRCLE', 'DISK', 'disk', 'CIRCLE'],
    'Colors Reported': ['RED', np.nan, 'BLUE', 'green', 'RED', 'RED', np.nan],
    'Time': ['6/1/1930 22:00', '6/30/1930 20:00', np.nan, '7/2/1930 19:00', '7/3/1930 21:00', 'invalid_date', '7/4/1930 20:00']
}

ufo = pd.DataFrame(data)

In [3]:
ufo

           City State Shape Reported Colors Reported             Time
0      New York    NY           DISK             RED   6/1/1930 22:00
1  los angeles     CA          light             NaN  6/30/1930 20:00
2       Chicago    IL            NaN            BLUE              NaN
3           NaN    TX         CIRCLE           green   7/2/1930 19:00
4       Houston   NaN           DISK             RED   7/3/1930 21:00
5       Phoenix    AZ           disk             RED     invalid_date
6        Dallas    TX         CIRCLE             NaN   7/4/1930 20:00

In [48]:
#1
ufo.isnull().sum()
#2
ufo.fillna({'Colors Reported':'Unknown'})
#3
bool_series=pd.notnull(ufo['Time'])
ufo = ufo[bool_series]
#4
ufo['City'] = ufo['City'].str.strip()
#5
ufo['City'] = ufo['City'].str.capitalize()
#7
ufo.rename(columns={'Shape Reported':'SHAPE REPORTED',"Colors Reported":"COLORS REPORTED"},inplace=False)
#8
#not any duplicates
reset_indexes = ufo.reset_index()
reset_indexes

,index,City,State,Shape Reported,Colors Reported,Time,Cit
0,0,New york,NY,DISK,RED,6/1/1930 22:00,New york
1,1,Los angeles,CA,light,NaN,6/30/1930 20:00,Los angeles
2,3,NaN,TX,CIRCLE,green,7/2/1930 19:00,NaN
3,4,Houston,NaN,DISK,RED,7/3/1930 21:00,Houston
4,5,Phoenix,AZ,disk,RED,invalid_date,Phoenix
5,6,Dallas,TX,CIRCLE,NaN,7/4/1930 20:00,dallas

type[   index         City State Shape Reported Colors Reported             Time  \
0      0     New york    NY           DISK             RED   6/1/1930 22:00
1      1  Los angeles    CA          light             NaN  6/30/1930 20:00
2      3          NaN    TX         CIRCLE           green   7/2/1930 19:00
3      4      Houston   NaN           DISK             RED   7/3/1930 21:00
4      5      Phoenix    AZ           disk             RED     invalid_date
5      6       Dallas    TX         CIRCLE             NaN   7/4/1930 20:00

            Cit
0      New york
1  Los angeles
2           NaN
3       Houston
4       Phoenix
5        dallas  ]

In [43]:
ufo

,City,State,Shape Reported,Colors Reported,Time,Cit
0,New york,NY,DISK,RED,6/1/1930 22:00,New york
1,Los angeles,CA,light,NaN,6/30/1930 20:00,Los angeles
3,NaN,TX,CIRCLE,green,7/2/1930 19:00,NaN
4,Houston,NaN,DISK,RED,7/3/1930 21:00,Houston
5,Phoenix,AZ,disk,RED,invalid_date,Phoenix
6,Dallas,TX,CIRCLE,NaN,7/4/1930 20:00,dallas